IdeaRS.OpenModel.Geometry3D.CoordSystemByVector
Coordinate system defined by vectors

IdeaRS.OpenModel.Geometry3D.CoordSystemByVector.VecX
Axis X unit vector

IdeaRS.OpenModel.Geometry3D.CoordSystemByVector.VecY
Axis Y unit vector

IdeaRS.OpenModel.Geometry3D.CoordSystemByVector.VecZ
Axis Z unit vector